/* Подреждане на числа във вектор в ненамаляващ ред. Обособено е в процедура.
   Намира се най-голяма стойност и се поставя накрая на редицата. Там тя е на нужното
   място и така остава да подредим редицата без последния ѝ член. За целта от тези
   оставащи членове намираме най-голяма стойност, поставяме я накрая и т.н., докато
   остане редица със само един член – той очевидно е най-малък и е на нужното място.
   Броят действия за подреждане на n стойности е пропорционален на n². */

#include <iostream>
#include <vector>

using namespace std;

template <typename T>
void maxUpSort(vector<T> & a) {
  for (int n = a.size()-1; n > 0; --n) {   // n = дължина на оставащата за подреждане редица
    int k, i;
    for (k = n, i = k-1; i >= 0; --i)      // k = индекс на (текущо) най-голяма стойност
      if (a[i] > a[k])
        k = i;
    swap(a[k],a[n]);                       // обменяне на намерената стойност с последната
  }
}

int main() {
  vector<int> a;
  for (int x; cin >> x;) a.push_back(x);   // четене на числата
  maxUpSort(a);
  for (auto x : a) cout << x << ' ';       // извеждане на подредения вектор
  cout << endl;
}
