/* Намиране на сечение на множества от числа, представени чрез вектори.
   Резултатът е множество-вектор.
   Всяко от двете дадени множества се чете от стандартния вход – първо броя
   членове в него, после самите членове.  Кое да е или и двете множества може
   да са празни.
   Намирането на сечението става в отделна процедура.  Възможните повторения
   на членове във второто множество не се появяват в резултата.
   Ако резултатът е празно множество, програмата не извежда нищо. */

#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

void set_intersection(vector<int> & a, vector<int> & b, vector<int> & c) {
  for (auto x : a)                              // добавяне на членовете на a в c –
    if (find(b.begin(),b.end(),x) != b.end())   // само тези, които са и в b
      c.push_back(x);
}

int main() {
  int n;
  cin >> n;                            // четене на първото множество
  vector<int> a(n);
  for (auto & x : a) cin >> x;
  cin >> n;                            // четене на второто множество
  vector<int> b(n);
  for (auto & x : b) cin >> x;
  vector<int> c;                       // образуване на празен резултат
  set_intersection(a,b,c);
  for (auto x : c) cout << x << ' ';   // извеждане на резултата
  cout << endl;
}