/* Намиране на обединение на множества от числа, представени чрез вектори.
   Резултатът е множество-вектор.
   Всяко от двете дадени множества се чете от стандартния вход – първо броя
   членове в него, после самите членове.  Кое да е или и двете множества може
   да са празни.
   Намирането на обединението става в отделна процедура.  Възможните повторения
   на членове във второто множество не се появяват в резултата.  Благодарение
   на това същата процедура може да служи и за отстраняване на повторенията в
   отделно взето множество (като първият аргумент е празно множество).
   Ако резултатът е празно множество, програмата не извежда нищо. */

#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

void set_union(vector<int> & a, vector<int> & b, vector<int> & c) {
  c = a;                                        // добавяне на членовете на a в c
  for (auto x : b)                              // добавяне на членовете на b в c
    if (find(c.begin(),c.end(),x) == c.end())   // без повтаряне
      c.push_back(x);
}

int main() {
  int n;
  cin >> n;                            // четене на първото множество
  vector<int> a(n);
  for (auto & x : a) cin >> x;
  cin >> n;                            // четене на второто множество
  vector<int> b(n);
  for (auto & x : b) cin >> x;
  vector<int> c;                       // образуване на празен резултат
  set_union(a,b,c);
  for (auto x : c) cout << x << ' ';   // извеждане на резултата
  cout << endl;
}
